STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G081B_EVAL/stm32g081b_eval_lcd.c
    /* Characters number per line */
    ysize = (BSP_LCD_GetXSize()/DrawProp.pFont->Width);

    switch (Mode)
    {
    case CENTER_MODE:
    {
        refcolumn = Xpos + ((ysize - size)* DrawProp.pFont->Width) / 2;
        break;
    }
    case LEFT_MODE:
    {
        refcolumn = Xpos;
        break;
    }
    case RIGHT_MODE:
    {
        refcolumn = Xpos + ((ysize - size)*DrawProp.pFont->Width);
        break;
    }
    default:
    {
        refcolumn = Xpos;
        break;
    }
    }

    /* Send the string character by character on lCD */
    while ((*pText != 0) & (((BSP_LCD_GetXSize() - (counter*DrawProp.pFont->Width)) & 0xFFFF) >= DrawProp.pFont->Width))
    {
        /* Display one character on LCD */
        BSP_LCD_DisplayChar(refcolumn, Ypos, *pText);
        /* Decrement the column position by 16 */
        refcolumn += DrawProp.pFont->Width;
        /* Point on the next character */
        pText++;
        counter++;
    }
}

/**
  * @brief  Displays a character on the LCD.
  * @param  Line: Line where to display the character shape
  *          This parameter can be one of the following values:
  *            @arg  0..9: if the Current fonts is Font16x24
  *            @arg  0..19: if the Current fonts is Font12x12 or Font8x12
  *            @arg  0..29: if the Current fonts is Font8x8
  * @param  pText: Pointer to string to display on LCD
  * @retval None
  */
void BSP_LCD_DisplayStringAtLine(uint16_t Line, uint8_t *pText)
{
    BSP_LCD_DisplayStringAt(0, LINE(Line),pText, LEFT_MODE);
}

/**
  * @brief  Reads an LCD pixel.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @retval RGB pixel color
  */
uint16_t BSP_LCD_ReadPixel(uint16_t Xpos, uint16_t Ypos)
{
    uint16_t ret = 0;

    if(lcd_drv->ReadPixel != NULL)
    {
        ret = lcd_drv->ReadPixel(Xpos, Ypos);
    }

    return ret;
}

/**
  * @brief  Draws an horizontal line.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @param  Length: Line length
  * @retval None
  */
void BSP_LCD_DrawHLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length)
{
    uint32_t index = 0;

    if(lcd_drv->DrawHLine != NULL)
    {
        lcd_drv->DrawHLine(DrawProp.TextColor, Ypos, Xpos, Length);
    }
    else
    {
        for(index = 0; index < Length; index++)
        {
            BSP_LCD_DrawPixel((Ypos + index), Xpos, DrawProp.TextColor);
        }
    }
}

/**
  * @brief  Draws a vertical line.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @param  Length: Line length
  * @retval None
  */
void BSP_LCD_DrawVLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length)
{
    uint32_t index = 0;

    if(lcd_drv->DrawVLine != NULL)
    {
        LCD_SetDisplayWindow(Ypos, Xpos, 1, Length);
        lcd_drv->DrawVLine(DrawProp.TextColor, Ypos, Xpos, Length);
        LCD_SetDisplayWindow(0, 0, BSP_LCD_GetXSize(), BSP_LCD_GetYSize());
    }
    else
    {
        for(index = 0; index < Length; index++)
        {
            BSP_LCD_DrawPixel(Ypos, Xpos + index, DrawProp.TextColor);
        }
    }
}

/**
  * @brief  Draws an uni-line (between two points).
  * @param  X1: Point 1 X position
  * @param  Y1: Point 1 Y position
  * @param  X2: Point 2 X position
  * @param  Y2: Point 2 Y position
  * @retval None
  */
void BSP_LCD_DrawLine(uint16_t X1, uint16_t Y1, uint16_t X2, uint16_t Y2)
{
    int16_t deltax = 0, deltay = 0, x = 0, y = 0, xinc1 = 0, xinc2 = 0,
            yinc1 = 0, yinc2 = 0, den = 0, num = 0, numadd = 0, numpixels = 0,
            curpixel = 0;

    deltax = ABS(Y2 - Y1);        /* The difference between the x's */
    deltay = ABS(X2 - X1);        /* The difference between the y's */
    x = Y1;                       /* Start x off at the first pixel */
    y = X1;                       /* Start y off at the first pixel */

    if (Y2 >= Y1)                 /* The x-values are increasing */
    {
        xinc1 = 1;
        xinc2 = 1;
    }
    else                          /* The x-values are decreasing */
    {
        xinc1 = -1;
        xinc2 = -1;
    }

    if (X2 >= X1)                 /* The y-values are increasing */
    {
        yinc1 = 1;
        yinc2 = 1;
    }
    else                          /* The y-values are decreasing */
    {
        yinc1 = -1;
        yinc2 = -1;
    }

    if (deltax >= deltay)         /* There is at least one x-value for every y-value */
    {
        xinc1 = 0;                  /* Don't change the x when numerator >= denominator */
        yinc2 = 0;                  /* Don't change the y for every iteration */
        den = deltax;
        num = deltax / 2;
        numadd = deltay;
        numpixels = deltax;         /* There are more x-values than y-values */
    }
    else                          /* There is at least one y-value for every x-value */
    {
        xinc2 = 0;                  /* Don't change the x for every iteration */
        yinc1 = 0;                  /* Don't change the y when numerator >= denominator */
        den = deltay;
        num = deltay / 2;
        numadd = deltax;
        numpixels = deltay;         /* There are more y-values than x-values */
    }

    for (curpixel = 0; curpixel <= numpixels; curpixel++)
    {
        BSP_LCD_DrawPixel(x, y, DrawProp.TextColor);  /* Draw the current pixel */
        num += numadd;                            /* Increase the numerator by the top of the fraction */
        if (num >= den)                           /* Check if numerator >= denominator */
        {
            num -= den;                             /* Calculate the new numerator value */
            x += xinc1;                             /* Change the x as appropriate */
            y += yinc1;                             /* Change the y as appropriate */
        }
        x += xinc2;                               /* Change the x as appropriate */
        y += yinc2;                               /* Change the y as appropriate */
    }
}

/**
  * @brief  Draws a rectangle.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @param  Width: Rectangle width
  * @param  Height: Rectangle height
  * @retval None
  */
void BSP_LCD_DrawRect(uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height)
{
    /* Draw horizontal lines */
    BSP_LCD_DrawHLine(Xpos, Ypos, Width);
    BSP_LCD_DrawHLine(Xpos, (Ypos+ Height), Width);

    /* Draw vertical lines */
    BSP_LCD_DrawVLine(Xpos, Ypos, Height);
    BSP_LCD_DrawVLine((Xpos + Width), Ypos, Height);
}

/**
  * @brief  Draws a circle.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @param  Radius: Circle radius
  * @retval None
  */
void BSP_LCD_DrawCircle(uint16_t Xpos, uint16_t Ypos, uint16_t Radius)
{
    int32_t  decision;       /* Decision Variable */
    uint32_t  curx;   /* Current X Value */
    uint32_t  cury;   /* Current Y Value */

    decision = 3 - (Radius << 1);
    curx = 0;
    cury = Radius;

    while (curx <= cury)
    {
        BSP_LCD_DrawPixel((Ypos + curx), (Xpos - cury), DrawProp.TextColor);

        BSP_LCD_DrawPixel((Ypos - curx), (Xpos - cury), DrawProp.TextColor);

