STMicroelectronics/STM32CubeG0/Drivers/BSP/STM32G081B_EVAL/stm32g081b_eval_lcd.c
        BSP_LCD_DrawPixel((Ypos + cury), (Xpos - curx), DrawProp.TextColor);

        BSP_LCD_DrawPixel((Ypos - cury), (Xpos - curx), DrawProp.TextColor);

        BSP_LCD_DrawPixel((Ypos + curx), (Xpos + cury), DrawProp.TextColor);

        BSP_LCD_DrawPixel((Ypos - curx), (Xpos + cury), DrawProp.TextColor);

        BSP_LCD_DrawPixel((Ypos + cury), (Xpos + curx), DrawProp.TextColor);

        BSP_LCD_DrawPixel((Ypos - cury), (Xpos + curx), DrawProp.TextColor);

        /* Initialize the font */
        BSP_LCD_SetFont(&LCD_DEFAULT_FONT);

        if (decision < 0)
        {
            decision += (curx << 2) + 6;
        }
        else
        {
            decision += ((curx - cury) << 2) + 10;
            cury--;
        }
        curx++;
    }
}

/**
  * @brief  Draws an poly-line (between many points).
  * @param  pPoints: Pointer to the points array
  * @param  PointCount: Number of points
  * @retval None
  */
void BSP_LCD_DrawPolygon(pPoint pPoints, uint16_t PointCount)
{
    int16_t x = 0, y = 0;

    if(PointCount < 2)
    {
        return;
    }

    BSP_LCD_DrawLine(pPoints->X, pPoints->Y, (pPoints+PointCount-1)->X, (pPoints+PointCount-1)->Y);

    while(--PointCount)
    {
        x = pPoints->X;
        y = pPoints->Y;
        pPoints++;
        BSP_LCD_DrawLine(x, y, pPoints->X, pPoints->Y);
    }

}

/**
  * @brief  Draws an ellipse on LCD.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @param  XRadius: Ellipse X radius
  * @param  YRadius: Ellipse Y radius
  * @retval None
  */
void BSP_LCD_DrawEllipse(int Xpos, int Ypos, int XRadius, int YRadius)
{
    int x = 0, y = -XRadius, err = 2-2*YRadius, e2;
    float k = 0, rad1 = 0, rad2 = 0;

    rad1 = YRadius;
    rad2 = XRadius;

    k = (float)(rad2/rad1);

    do {
        BSP_LCD_DrawPixel((Ypos-(uint16_t)(x/k)), (Xpos+y), DrawProp.TextColor);
        BSP_LCD_DrawPixel((Ypos+(uint16_t)(x/k)), (Xpos+y), DrawProp.TextColor);
        BSP_LCD_DrawPixel((Ypos+(uint16_t)(x/k)), (Xpos-y), DrawProp.TextColor);
        BSP_LCD_DrawPixel((Ypos-(uint16_t)(x/k)), (Xpos-y), DrawProp.TextColor);

        e2 = err;
        if (e2 <= x) {
            err += ++x*2+1;
            if (-y == x && e2 <= y) e2 = 0;
        }
        if (e2 > y) err += ++y*2+1;
    }
    while (y <= 0);
}

/**
  * @brief  Draws a bitmap picture loaded in the internal Flash (32 bpp).
  * @param  Xpos: Bmp X position in the LCD
  * @param  Ypos: Bmp Y position in the LCD
  * @param  pBmp: Pointer to Bmp picture address in the internal Flash
  * @retval None
  */
void BSP_LCD_DrawBitmap(uint16_t Xpos, uint16_t Ypos, uint8_t *pBmp)
{
    uint32_t height = 0, width  = 0;

    /* Read bitmap width */
    width = pBmp[18] + (pBmp[19] << 8) + (pBmp[20] << 16) + (pBmp[21] << 24);

    /* Read bitmap height */
    height = pBmp[22] + (pBmp[23] << 8) + (pBmp[24] << 16) + (pBmp[25] << 24);

    /* Remap Ypos, hx8347d works with inverted X in case of bitmap */
    /* X = 0, cursor is on Bottom corner */
    if(lcd_drv == &hx8347d_drv)
    {
        Ypos = BSP_LCD_GetYSize() - Ypos - height;
    }

    LCD_SetDisplayWindow(Ypos, Xpos, width, height);

    if(lcd_drv->DrawBitmap != NULL)
    {
        lcd_drv->DrawBitmap(Ypos, Xpos, pBmp);
    }
    LCD_SetDisplayWindow(0, 0, BSP_LCD_GetXSize(), BSP_LCD_GetYSize());
}

/**
  * @brief  Draws a full rectangle.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @param  Width: Rectangle width
  * @param  Height: Rectangle height
  * @retval None
  */
void BSP_LCD_FillRect(uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height)
{
    BSP_LCD_SetTextColor(DrawProp.TextColor);
    do
    {
        BSP_LCD_DrawHLine(Xpos, Ypos++, Width);
    }
    while(Height--);
}

/**
  * @brief  Draws a full circle.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @param  Radius: Circle radius
  * @retval None
  */
void BSP_LCD_FillCircle(uint16_t Xpos, uint16_t Ypos, uint16_t Radius)
{
    int32_t  decision;        /* Decision Variable */
    uint32_t  curx;    /* Current X Value */
    uint32_t  cury;    /* Current Y Value */

    decision = 3 - (Radius << 1);

    curx = 0;
    cury = Radius;

    BSP_LCD_SetTextColor(DrawProp.TextColor);

    while (curx <= cury)
    {
        if(cury > 0)
        {
            BSP_LCD_DrawVLine(Xpos + curx, Ypos - cury, 2*cury);
            BSP_LCD_DrawVLine(Xpos - curx, Ypos - cury, 2*cury);
        }

        if(curx > 0)
        {
            BSP_LCD_DrawVLine(Xpos - cury, Ypos - curx, 2*curx);
            BSP_LCD_DrawVLine(Xpos + cury, Ypos - curx, 2*curx);
        }
        if (decision < 0)
        {
            decision += (curx << 2) + 6;
        }
        else
        {
            decision += ((curx - cury) << 2) + 10;
            cury--;
        }
        curx++;
    }

    BSP_LCD_SetTextColor(DrawProp.TextColor);
    BSP_LCD_DrawCircle(Xpos, Ypos, Radius);
}

/**
  * @brief  Draws a full ellipse.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @param  XRadius: Ellipse X radius
  * @param  YRadius: Ellipse Y radius
  * @retval None
  */
void BSP_LCD_FillEllipse(int Xpos, int Ypos, int XRadius, int YRadius)
{
    int x = 0, y = -XRadius, err = 2-2*YRadius, e2;
    float k = 0, rad1 = 0, rad2 = 0;

    rad1 = YRadius;
    rad2 = XRadius;

    k = (float)(rad2/rad1);

    do
    {
        BSP_LCD_DrawVLine((Xpos+y), (Ypos-(uint16_t)(x/k)), (2*(uint16_t)(x/k) + 1));
        BSP_LCD_DrawVLine((Xpos-y), (Ypos-(uint16_t)(x/k)), (2*(uint16_t)(x/k) + 1));

        e2 = err;
        if (e2 <= x)
        {
            err += ++x*2+1;
            if (-y == x && e2 <= y) e2 = 0;
        }
        if (e2 > y) err += ++y*2+1;
    }
    while (y <= 0);
}

/**
  * @brief  Enables the display.
  * @retval None
  */
void BSP_LCD_DisplayOn(void)
{
    lcd_drv->DisplayOn();
}

/**
  * @brief  Disables the display.
  * @retval None
  */
void BSP_LCD_DisplayOff(void)
{
    lcd_drv->DisplayOff();
}

/**
  * @brief  Draws a pixel on LCD.
  * @param  Xpos: X position
  * @param  Ypos: Y position
  * @param  RGBCode: Pixel color in RGB mode (5-6-5)
  * @retval None
  */
void BSP_LCD_DrawPixel(uint16_t Xpos, uint16_t Ypos, uint16_t RGBCode)
{
    if(lcd_drv->WritePixel != NULL)
    {
        lcd_drv->WritePixel(Xpos, Ypos, RGBCode);
    }
}
/**
  * @}
  */

